Return a copy of an object derived from LightShape
  Namespace:   Autodesk.Revit.DB.Lighting
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public LightShape GetLightShape()
  Visual Basic
Public Function GetLightShape As LightShape
  Visual C++
public:
LightShape^ GetLightShape()
 See Also
  LightType Class
  Autodesk.Revit.DB.Lighting Namespace